Qh1114/MSP_Gimbal_New/empty.syscfg
/**
 * These arguments were used when this file was generated. They will be automatically applied on subsequent loads
 * via the GUI or CLI. Run CLI with '--help' for additional information on how to override these arguments.
 * @cliArgs --device "MSPM0G350X" --part "Default" --package "LQFP-64(PM)" --product "mspm0_sdk@2.10.00.04"
 * @v2CliArgs --device "MSPM0G3507" --package "LQFP-64(PM)" --product "mspm0_sdk@2.10.00.04"
 * @versions {"tool":"1.26.2+4477"}
 */

/**
 * Import the modules used in this configuration.
 */
const ADC12    = scripting.addModule("/ti/driverlib/ADC12", {}, false);
const ADC121   = ADC12.addInstance();
const CAPTURE  = scripting.addModule("/ti/driverlib/CAPTURE", {}, false);
const CAPTURE1 = CAPTURE.addInstance();
const GPIO     = scripting.addModule("/ti/driverlib/GPIO", {}, false);
const GPIO1    = GPIO.addInstance();
const GPIO2    = GPIO.addInstance();
const GPIO3    = GPIO.addInstance();
const GPIO4    = GPIO.addInstance();
const GPIO5    = GPIO.addInstance();
const GPIO6    = GPIO.addInstance();
const GPIO7    = GPIO.addInstance();
const GPIO8    = GPIO.addInstance();
const GPIO9    = GPIO.addInstance();
const I2C      = scripting.addModule("/ti/driverlib/I2C", {}, false);
const I2C1     = I2C.addInstance();
const PWM      = scripting.addModule("/ti/driverlib/PWM", {}, false);
const PWM1     = PWM.addInstance();
const PWM2     = PWM.addInstance();
const PWM3     = PWM.addInstance();
const SPI      = scripting.addModule("/ti/driverlib/SPI", {}, false);
const SPI1     = SPI.addInstance();
const SYSCTL   = scripting.addModule("/ti/driverlib/SYSCTL");
const SYSTICK  = scripting.addModule("/ti/driverlib/SYSTICK");
const TIMER    = scripting.addModule("/ti/driverlib/TIMER", {}, false);
const TIMER1   = TIMER.addInstance();
const TIMER2   = TIMER.addInstance();
const UART     = scripting.addModule("/ti/driverlib/UART", {}, false);
const UART1    = UART.addInstance();
const UART2    = UART.addInstance();
const UART3    = UART.addInstance();
const UART4    = UART.addInstance();

/**
 * Write custom configuration values to the imported modules.
 */
const divider6       = system.clockTree["PLL_CLK2X_DIV"];
divider6.divideValue = 4;

const divider9       = system.clockTree["UDIV"];
divider9.divideValue = 2;

const multiplier2         = system.clockTree["PLL_QDIV"];
multiplier2.multiplyValue = 5;

const mux4       = system.clockTree["EXHFMUX"];
mux4.inputSelect = "EXHFMUX_XTAL";

const mux8       = system.clockTree["HSCLKMUX"];
mux8.inputSelect = "HSCLKMUX_SYSPLL2X";

ADC121.$name                             = "BAT_ADC";
ADC121.sampClkSrc                        = "DL_ADC12_CLOCK_ULPCLK";
ADC121.sampleTime0                       = "200us";
ADC121.enabledInterrupts                 = ["DL_ADC12_INTERRUPT_MEM0_RESULT_LOADED"];
ADC121.powerDownMode                     = "DL_ADC12_POWER_DOWN_MODE_MANUAL";
ADC121.adcMem0avgen                      = true;
ADC121.hwNumerator                       = "DL_ADC12_HW_AVG_NUM_ACC_8";
ADC121.peripheral.$assign                = "ADC0";
ADC121.peripheral.adcPin0.$assign        = "PA27";
ADC121.adcPin0Config.hideOutputInversion = scripting.forceWrite(false);
ADC121.adcPin0Config.$name               = "ti_driverlib_gpio_GPIOPinGeneric8";

const Board = scripting.addModule("/ti/driverlib/Board", {}, false);

CAPTURE1.$name               = "CAPTURE_0";
CAPTURE1.ccp0PinConfig.$name = "ti_driverlib_gpio_GPIOPinGeneric20";

GPIO1.$name                          = "OLED";
GPIO1.associatedPins.create(3);
GPIO1.associatedPins[0].$name        = "OLED_CS";
GPIO1.associatedPins[0].assignedPort = "PORTB";
GPIO1.associatedPins[0].assignedPin  = "14";
GPIO1.associatedPins[0].initialValue = "SET";
GPIO1.associatedPins[0].pin.$assign  = "PB14";
GPIO1.associatedPins[1].$name        = "OLED_DC";
GPIO1.associatedPins[1].assignedPort = "PORTB";
GPIO1.associatedPins[1].assignedPin  = "11";
GPIO1.associatedPins[1].pin.$assign  = "PB11";
GPIO1.associatedPins[2].$name        = "OLED_RES";
GPIO1.associatedPins[2].assignedPort = "PORTB";
GPIO1.associatedPins[2].assignedPin  = "10";
GPIO1.associatedPins[2].pin.$assign  = "PB10";

GPIO2.$name                          = "FLASH";
GPIO2.associatedPins[0].$name        = "FLASH_CS";
GPIO2.associatedPins[0].assignedPort = "PORTB";
GPIO2.associatedPins[0].assignedPin  = "6";
GPIO2.associatedPins[0].initialValue = "SET";
GPIO2.associatedPins[0].pin.$assign  = "PB6";

GPIO3.$name                              = "ICM";
GPIO3.associatedPins.create(2);
GPIO3.associatedPins[0].$name            = "ICM_CS";
GPIO3.associatedPins[0].initialValue     = "SET";
GPIO3.associatedPins[0].internalResistor = "PULL_UP";
GPIO3.associatedPins[0].assignedPort     = "PORTA";
GPIO3.associatedPins[0].assignedPin      = "30";
GPIO3.associatedPins[0].pin.$assign      = "PA30";
GPIO3.associatedPins[1].$name            = "ICM_INT";
GPIO3.associatedPins[1].assignedPort     = "PORTB";
GPIO3.associatedPins[1].assignedPin      = "21";
GPIO3.associatedPins[1].direction        = "INPUT";
GPIO3.associatedPins[1].internalResistor = "PULL_UP";
GPIO3.associatedPins[1].pin.$assign      = "PB21";

GPIO4.$name                          = "MOTOR";
GPIO4.associatedPins.create(5);
GPIO4.associatedPins[0].$name        = "MOTOR_AIN2";
GPIO4.associatedPins[0].assignedPort = "PORTB";
GPIO4.associatedPins[0].assignedPin  = "12";
GPIO4.associatedPins[0].initialValue = "SET";
GPIO4.associatedPins[0].pin.$assign  = "PB12";
GPIO4.associatedPins[1].$name        = "MOTOR_AIN1";
GPIO4.associatedPins[1].assignedPort = "PORTB";
GPIO4.associatedPins[1].assignedPin  = "13";
GPIO4.associatedPins[1].initialValue = "SET";
GPIO4.associatedPins[1].pin.$assign  = "PB13";
GPIO4.associatedPins[2].$name        = "MOTOR_STBY";
GPIO4.associatedPins[2].assignedPort = "PORTA";
GPIO4.associatedPins[2].assignedPin  = "13";
GPIO4.associatedPins[2].pin.$assign  = "PA13";
GPIO4.associatedPins[3].$name        = "MOTOR_BIN1";
GPIO4.associatedPins[3].assignedPort = "PORTA";
GPIO4.associatedPins[3].assignedPin  = "12";
GPIO4.associatedPins[3].initialValue = "SET";
GPIO4.associatedPins[3].pin.$assign  = "PA12";
GPIO4.associatedPins[4].$name        = "PMOTOR_BIN2";
GPIO4.associatedPins[4].assignedPort = "PORTB";
GPIO4.associatedPins[4].assignedPin  = "23";
GPIO4.associatedPins[4].initialValue = "SET";
GPIO4.associatedPins[4].pin.$assign  = "PB23";

GPIO5.$name                               = "ENCODER";
GPIO5.associatedPins.create(4);
GPIO5.associatedPins[0].$name             = "ENA_L";
GPIO5.associatedPins[0].assignedPort      = "PORTB";
GPIO5.associatedPins[0].assignedPin       = "16";
GPIO5.associatedPins[0].direction         = "INPUT";
GPIO5.associatedPins[0].interruptEn       = true;
GPIO5.associatedPins[0].polarity          = "RISE_FALL";
GPIO5.associatedPins[0].interruptPriority = "1";
GPIO5.associatedPins[0].inputFilter       = "8_CYCLES";
GPIO5.associatedPins[0].internalResistor  = "PULL_UP";
GPIO5.associatedPins[0].pin.$assign       = "PB16";
GPIO5.associatedPins[1].$name             = "ENB_L";
GPIO5.associatedPins[1].assignedPort      = "PORTB";
GPIO5.associatedPins[1].assignedPin       = "2";
GPIO5.associatedPins[1].direction         = "INPUT";
GPIO5.associatedPins[1].interruptEn       = true;
GPIO5.associatedPins[1].polarity          = "RISE_FALL";
GPIO5.associatedPins[1].interruptPriority = "1";
GPIO5.associatedPins[1].inputFilter       = "8_CYCLES";
GPIO5.associatedPins[1].internalResistor  = "PULL_UP";
GPIO5.associatedPins[1].pin.$assign       = "PB2";
GPIO5.associatedPins[2].$name             = "ENA_R";
GPIO5.associatedPins[2].assignedPin       = "27";
GPIO5.associatedPins[2].assignedPort      = "PORTB";
GPIO5.associatedPins[2].direction         = "INPUT";
GPIO5.associatedPins[2].interruptEn       = true;
GPIO5.associatedPins[2].polarity          = "RISE_FALL";
GPIO5.associatedPins[2].interruptPriority = "1";
GPIO5.associatedPins[2].inputFilter       = "8_CYCLES";
GPIO5.associatedPins[2].internalResistor  = "PULL_UP";
GPIO5.associatedPins[2].pin.$assign       = "PB27";
GPIO5.associatedPins[3].$name             = "ENB_R";
GPIO5.associatedPins[3].assignedPort      = "PORTA";
GPIO5.associatedPins[3].assignedPin       = "29";
GPIO5.associatedPins[3].direction         = "INPUT";
GPIO5.associatedPins[3].polarity          = "RISE_FALL";
GPIO5.associatedPins[3].interruptEn       = true;
GPIO5.associatedPins[3].interruptPriority = "1";
GPIO5.associatedPins[3].inputFilter       = "8_CYCLES";
GPIO5.associatedPins[3].internalResistor  = "PULL_UP";
GPIO5.associatedPins[3].pin.$assign       = "PA29";

GPIO6.$name                          = "GRAYSCALE";
GPIO6.associatedPins.create(4);
GPIO6.associatedPins[0].$name        = "OUT";
GPIO6.associatedPins[0].assignedPort = "PORTB";
GPIO6.associatedPins[0].assignedPin  = "25";
GPIO6.associatedPins[0].direction    = "INPUT";
GPIO6.associatedPins[0].pin.$assign  = "PB25";
GPIO6.associatedPins[1].$name        = "AD0";
GPIO6.associatedPins[1].assignedPort = "PORTB";
GPIO6.associatedPins[1].assignedPin  = "24";
GPIO6.associatedPins[1].pin.$assign  = "PB24";
GPIO6.associatedPins[2].$name        = "AD1";
GPIO6.associatedPins[2].assignedPort = "PORTB";
GPIO6.associatedPins[2].assignedPin  = "20";
GPIO6.associatedPins[2].pin.$assign  = "PB20";
GPIO6.associatedPins[3].$name        = "AD2";
GPIO6.associatedPins[3].assignedPort = "PORTA";
GPIO6.associatedPins[3].assignedPin  = "22";
GPIO6.associatedPins[3].pin.$assign  = "PA22";

GPIO7.$name                               = "LASER";
GPIO7.associatedPins.create(6);
GPIO7.associatedPins[0].$name             = "XSHUT1";
GPIO7.associatedPins[0].assignedPort      = "PORTA";
GPIO7.associatedPins[0].assignedPin       = "24";
GPIO7.associatedPins[0].initialValue      = "SET";
GPIO7.associatedPins[0].pin.$assign       = "PA24";
GPIO7.associatedPins[1].$name             = "GPIO1";
GPIO7.associatedPins[1].assignedPort      = "PORTA";
GPIO7.associatedPins[1].assignedPin       = "31";
GPIO7.associatedPins[1].direction         = "INPUT";
GPIO7.associatedPins[1].interruptEn       = true;
GPIO7.associatedPins[1].polarity          = "FALL";
GPIO7.associatedPins[1].interruptPriority = "3";
GPIO7.associatedPins[1].internalResistor  = "PULL_UP";
GPIO7.associatedPins[1].pin.$assign       = "PA31";
GPIO7.associatedPins[2].$name             = "XSHUT2";
GPIO7.associatedPins[2].assignedPort      = "PORTB";
GPIO7.associatedPins[2].assignedPin       = "22";
GPIO7.associatedPins[2].initialValue      = "SET";
GPIO7.associatedPins[2].pin.$assign       = "PB22";
GPIO7.associatedPins[3].$name             = "GPIO2";
GPIO7.associatedPins[3].assignedPort      = "PORTB";
GPIO7.associatedPins[3].assignedPin       = "1";
GPIO7.associatedPins[3].direction         = "INPUT";
GPIO7.associatedPins[3].polarity          = "FALL";
GPIO7.associatedPins[3].interruptEn       = true;
GPIO7.associatedPins[3].interruptPriority = "3";
GPIO7.associatedPins[3].internalResistor  = "PULL_UP";
GPIO7.associatedPins[3].pin.$assign       = "PB1";
GPIO7.associatedPins[4].$name             = "XSHUT3";
GPIO7.associatedPins[4].assignedPort      = "PORTB";
GPIO7.associatedPins[4].assignedPin       = "0";
GPIO7.associatedPins[4].initialValue      = "SET";
GPIO7.associatedPins[4].pin.$assign       = "PB0";
GPIO7.associatedPins[5].$name             = "GPIO3";
GPIO7.associatedPins[5].assignedPort      = "PORTA";
GPIO7.associatedPins[5].assignedPin       = "7";
GPIO7.associatedPins[5].direction         = "INPUT";
GPIO7.associatedPins[5].interruptEn       = true;
GPIO7.associatedPins[5].polarity          = "FALL";
GPIO7.associatedPins[5].interruptPriority = "3";
GPIO7.associatedPins[5].internalResistor  = "PULL_UP";
GPIO7.associatedPins[5].pin.$assign       = "PA7";

